*** Categories and Tools

When generating the XML, I merged the categories and tools in =astro.build=, so
these groups are available for repo commands.

#+begin_src sh :results output :wrap example yaml
xq -y '
   .manifest.project
   | map(."@groups")
   | unique
   | map(split(","))
   | reduce .[] as $item ([]; . + $item)
   | sort
   | unique' ../astro-themes.xml
#+end_src

#+RESULTS:
#+begin_example yaml
- alpinejs
- blog
- docs
- ecommerce
- featured
- landing-page
- lit
- mdx
- minimal
- other
- portfolio
- postcss
- preact
- react
- sass
- solidjs
- svelte
- tailwind
- typescript
- unocss
- vue
#+end_example


** Astro RSS

Based on the =astro-rss= and =astro-sitemap= packages. They have similar
dependencies and build requirements.

#+begin_src sh :dir (identity astroroot) :results verbatim
tree packages/astro-rss
#+end_src

#+RESULTS:
#+begin_example
packages/astro-rss
├── CHANGELOG.md
├── package.json
├── README.md
├── src
│   ├── index.ts
│   ├── schema.ts
│   └── util.ts
├── test
│   ├── pagesGlobToRssItems.test.js
│   ├── rss.test.js
│   └── test-utils.js
└── tsconfig.json

3 directories, 10 files
#+end_example


** Astro Sitemap

#+begin_src sh :dir (identity astroroot) :results verbatim
tree -L 3 packages/integrations/sitemap
#+end_src

#+RESULTS:
#+begin_example
packages/integrations/sitemap
├── CHANGELOG.md
├── package.json
├── README.md
├── src
│   ├── config-defaults.ts
│   ├── generate-sitemap.ts
│   ├── index.ts
│   ├── schema.ts
│   ├── utils
│   │   ├── is-object-empty.ts
│   │   ├── is-valid-url.ts
│   │   └── parse-url.ts
│   └── validate-options.ts
├── test
│   ├── base-path.test.js
│   ├── filter.test.js
│   ├── fixtures
│   │   ├── ssr
│   │   ├── static
│   │   └── trailing-slash
│   ├── prefix.test.js
│   ├── routes.test.js
│   ├── smoke.test.js
│   ├── ssr.test.js
│   ├── staticPaths.test.js
│   ├── test-utils.js
│   └── trailing-slash.test.js
└── tsconfig.json

8 directories, 21 files
#+end_example


